Repository: Yudaotor/lyrimuse
Catalog: lyrimuse/Localization/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: 预计%@，可随时停止
en: Roughly %@, and you can stop any time
zh_hant: 預計%@，可隨時停止

source: 另一轮扫描正在进行，请在完成后再试
en: Another scan is in progress. Try again when it finishes
zh_hant: 另一輪掃描正在進行，請在完成後再試

source: 上一轮扫描尚未完成，稍后将自动继续
en: The previous run hasn't finished; it resumes automatically
zh_hant: 上一輪掃描尚未完成，稍後將自動繼續

source: 网络不可用，稍后重试…
en: No connection, retrying shortly…
zh_hant: 網路不可用，稍後重試…

source: 因网络不可用已停止
en: Stopped: no connection
zh_hant: 因網路不可用已停止

source: 网络不可用，已暂停，稍后将自动继续
en: Paused: no connection; it resumes automatically
zh_hant: 網路不可用，已暫停，稍後將自動繼續

source: 上次：检查 %1$@ 首，更新 %2$@ 首
en: Last run: checked %1$@, updated %2$@
zh_hant: 上次：檢查 %1$@ 首，更新 %2$@ 首

source: 上次：检查 %1$@ 首后停止，更新 %2$@ 首
en: Last run: stopped after checking %1$@, updated %2$@
zh_hant: 上次：檢查 %1$@ 首後停止，更新 %2$@ 首

source: 约 %@ 小时
en: about %@ hours
zh_hant: 約 %@ 小時

source: 不足 1 小时
en: under an hour
zh_hant: 不足 1 小時

source: 预计还需%@
en: about %@ to go
zh_hant: 預計還需%@

source: 即将完成
en: almost done
zh_hant: 即將完成

source: 悬停时显示控制条
en: Controls on Hover
zh_hant: 指向時顯示控制列

source: 连接 Apple Music
en: Connect Apple Music
zh_hant: 連線至 Apple Music

source: 连接账号
en: Connect
zh_hant: 連結帳號

source: 登录中…
en: Signing In…
zh_hant: 登入中…

source: 已连接 · %@ · 登录有效期至 %@
en: Connected · %@ · Sign-in valid until %@
zh_hant: 已連線 · %@ · 登入有效期至 %@

source: %@ · 登录将在 %@ 过期，建议重新连接
en: %@ · Sign-in expires on %@; reconnecting is recommended
zh_hant: %@ · 登入將在 %@ 過期，建議重新連線

source: 登录已过期，请重新连接
en: Sign-in has expired; reconnect to continue
zh_hant: 登入已過期，請重新連線

source: 尚未连接 Apple Music。可在「歌词来源」卡片底部点按「连接」登录（需要 Apple Music 订阅）
en: Apple Music is not connected yet — sign in once via Connect at the bottom of the Lyrics Sources card (an Apple Music subscription is required)
zh_hant: 尚未連線 Apple Music。可在「歌詞來源」卡片底部按一下「連線」登入（需要 Apple Music 訂閱）

source: Apple Music 的登录已过期或被吊销（有效期 6 个月，Apple 不提供自动续期），请在「歌词来源」卡片底部重新连接
en: The Apple Music sign-in has expired or been revoked (it lasts 6 months and Apple issues no renewable token) — reconnect at the bottom of the Lyrics Sources card
zh_hant: Apple Music 的登入已過期或被撤銷（有效期 6 個月，Apple 不提供自動續期），請在「歌詞來源」卡片底部重新連線

source: 无法获取 Apple Music 接口的公共访问令牌（无法连接 music.apple.com），可能是网络问题，稍后重试通常可恢复
en: Could not obtain the public access token for the Apple Music API (music.apple.com is unreachable) — usually a network issue; retrying later normally works
zh_hant: 無法取得 Apple Music 介面的公共存取權杖（無法連線 music.apple.com），可能是網路問題，稍後重試通常可恢復

source: Apple Music 账号连接
en: Apple Music Account Connection
zh_hant: Apple Music 帳號連線

source: 连接后可获取 Apple Music 官方歌词，需要 Apple Music 订阅
en: Connect to get Apple Music's official lyrics. Requires an Apple Music subscription
zh_hant: 連線後可取得 Apple Music 官方歌詞，需要 Apple Music 訂閱

source: 添加播放器…
en: Add a Player…
zh_hant: 新增播放器…

source: 从「应用程序」中选择，无需等待其开始播放
en: Pick one from Applications — no need to wait until it’s playing
zh_hant: 從「應用程式」中選擇，無需等待其開始播放

source: 选择…
en: Choose…
zh_hant: 選擇…

source: 添加的应用与内置播放器相同：显示其正在播放的内容，并计入收听记录。可随时移除。
en: An app you add here counts the same as a built-in player: whatever it plays is shown, and it goes into your listening history. Remove it any time.
zh_hant: 新增的 App 與內建播放器相同：顯示其正在播放的內容，並計入聆聽記錄。可隨時移除。

source: 无法添加
en: Couldn’t Add It
zh_hant: 無法新增

source: 选择要让 Lyrimuse 视为播放器的应用
en: Pick an app you want Lyrimuse to treat as a player
zh_hant: 選擇要讓 Lyrimuse 視為播放器的 App

source: 这是 Lyrimuse 本身。
en: That’s Lyrimuse itself.
zh_hant: 這是 Lyrimuse 本身。

source: 「%@」已是内置播放器，在上方「播放器」卡片中勾选即可。
en: “%@” is already a built-in player — just tick it in the Players card above.
zh_hant: 「%@」已是內建播放器，在上方「播放器」卡片中勾選即可。

source: 「%@」已在列表中。
en: “%@” is already in this list.

source: %1$@ 首来自歌词源，%2$@ 首为机器翻译
en: %1$@ from the source, %2$@ machine-translated
zh_hant: %1$@ 首來自歌詞來源，%2$@ 首為機器翻譯

source: %@ 首待搜索
en: %@ to search
zh_hant: %@ 首待搜尋

source: 汽水音乐
en: Soda Music
zh_hant: 汽水音樂

source: 汽水音乐的歌词接口返回了无法识别的内容（接口可能已变更），并非这首歌曲没有歌词，通常会在后续版本中修复
en: Soda Music's lyrics endpoint returned something unrecognizable (the API may have changed) — this does not mean the song has no lyrics; an app update usually fixes it
zh_hant: 汽水音樂的歌詞介面傳回了無法識別的內容（介面可能已變更），並非這首歌曲沒有歌詞，通常會在後續版本中修復

source: 无缺失
en: Nothing missing
zh_hant: 無缺漏

source: 歌曲无歌词或仍在搜索时，在歌词位置显示歌名，不收起为小图标；获取歌词后立即切换为歌词。暂停时仍收起为图标，广告期间不显示
en: While a song has no lyrics or is still being searched, keep the lyrics slot with the song title instead of collapsing to the icon; the line is swapped in as soon as lyrics arrive. Still collapses when paused, and never shows during ads
zh_hant: 歌曲無歌詞或仍在搜尋時，在歌詞位置顯示歌名，不收起為小圖像；取得歌詞後立即切換為歌詞。暫停時仍收起為圖像，廣告期間不顯示

source: 无法读取 %@ 的歌词缓存
en: Can't read %@'s lyrics cache
zh_hant: 無法讀取 %@ 的歌詞快取

source: %@ 的歌词缓存位于受系统保护的目录中。授予「完全磁盘访问权限」后，可直接使用本机已有的逐字歌词，无需每次联网搜索。
en: %@ keeps its lyrics cache inside a system-protected folder. Grant Full Disk Access and the word-by-word lyrics already on this Mac can be used straight away, with no online search.
zh_hant: %@ 的歌詞快取位於受系統保護的目錄中。授予「完整磁碟取用權限」後，可直接使用本機已有的逐字歌詞，無需每次連線搜尋。

source: 无法读取 %@ 的歌词缓存，点按查看处理方法
en: Can't read %@'s lyrics cache — click to see what to do
zh_hant: 無法讀取 %@ 的歌詞快取，按一下查看處理方法

source: 预解析待播曲目
en: Pre-Resolve Upcoming Tracks
zh_hant: 預解析待播曲目

source: 左侧
en: Left
zh_hant: 左側

source: 右侧
en: Right
zh_hant: 右側

source: 样式
en: Style
zh_hant: 樣式

source: 渐变
en: Gradient
zh_hant: 漸層

source: 颜色
en: Color
zh_hant: 顏色

source: 顶部颜色
en: Top Color
zh_hant: 頂部顏色

source: 底部颜色
en: Bottom Color
zh_hant: 底部顏色

source: 方向
en: Direction

source: 从上到下
en: Top to Bottom
zh_hant: 從上到下

source: 从左到右
en: Left to Right
zh_hant: 從左到右

source: 左侧颜色
en: Left Color
zh_hant: 左側顏色

source: 右侧颜色
en: Right Color
zh_hant: 右側顏色

source: 歌词窗口的歌词字体（正文、译文、读音）
en: Lyrics font for the lyrics window (main text, translation, romanization)
zh_hant: 歌詞視窗的歌詞字體（正文、譯文、讀音）

source: 仅作用于歌词；字号随窗口大小自动调整
en: Applies to lyrics only; size scales with the window
zh_hant: 僅作用於歌詞；字級隨視窗大小自動調整

source: 仅部分专辑提供；低电量或「减弱动态效果」时自动暂停
en: Available on some albums only; pauses in Low Power Mode or with Reduce Motion on
zh_hant: 僅部分專輯提供；低電量或「減少動態效果」時自動暫停

source: 动态封面缓存
en: Animated Artwork Cache
zh_hant: 動態封面快取

source: 已下载的动态封面占用的磁盘空间；清除后再次显示时会重新下载
en: Disk space used by downloaded animated artwork; anything cleared downloads again the next time it's shown
zh_hant: 已下載的動態封面佔用的磁碟空間；清除後再次顯示時會重新下載

source: 清除
en: Clear

source: 进入迷你尺寸
en: Enter Mini Size
zh_hant: 進入迷你尺寸

source: 退出迷你尺寸
en: Exit Mini Size
zh_hant: 離開迷你尺寸

source: 外观
en: Appearance
zh_hant: 外觀

source: 完整尺寸
en: Full Size

source: 迷你尺寸
en: Mini Size

source: 顶部信息
en: Header
zh_hant: 頂部資訊

source: 显示
en: Show
zh_hant: 顯示

source: 浓淡
en: Density
zh_hant: 濃淡

source: 毛玻璃效果折射窗口后方的桌面，因此在此模式下窗口本身为透明
en: Frosted glass refracts whatever is behind the window, so the window itself is transparent in this mode
zh_hant: 毛玻璃效果折射視窗後方的桌面，因此在此模式下視窗本身為透明

source: 毛玻璃的材质浓淡（五档）
en: Frosted glass material density (five levels)
zh_hant: 毛玻璃的材質濃淡（五檔）

source: 此为上限：窗口足够大时使用此字号，窗口缩小时文字随之缩小，以免超出窗口
en: This is a ceiling: the text uses this size when the window is large enough, and shrinks with the window so it never overflows
zh_hant: 此為上限：視窗足夠大時使用此字級，視窗縮小時文字隨之縮小，以免超出視窗

source: 迷你尺寸的歌词字号上限
en: Ceiling for the mini size's lyrics font size
zh_hant: 迷你尺寸的歌詞字級上限

source: 长句处理
en: Long Lines
zh_hant: 長句處理

source: 换句动画
en: Line Transition
zh_hant: 換句動畫

source: 换句时，下一句从原来的位置移到当前行；关闭时直接切换
en: When the lyric changes, the next line moves up into place. When off, lines switch instantly
zh_hant: 換句時，下一句從原本的位置移到目前這一行；關閉時直接切換

source: 换行
en: Wrap
zh_hant: 換行

source: 滚动
en: Scroll
zh_hant: 捲動

source: 换行（默认）：一行显示不下时折行显示，窗口随之增高。 滚动：每句只占一行，超出部分横向滚动；有逐字时间轴时随演唱进度滚动。
en: Wrap (default): long lines fold onto the next line and the window grows taller. Scroll: every line stays one line tall and the overflow scrolls sideways — following the singing when the line has word-level timings.
zh_hant: 換行（預設）：一行顯示不下時折行顯示，視窗隨之增高。 捲動：每句只佔一行，超出部分橫向捲動；有逐字時間軸時隨演唱進度捲動。

source: 玻璃浓淡
en: Glass Density
zh_hant: 玻璃濃淡

source: 未授权时无法准确读取播放进度，也无法控制播放
en: Without it, the playback position drifts and the controls do nothing
zh_hant: 未授權時無法準確讀取播放進度，也無法控制播放

source: %@ 自动化权限
en: %@ automation permission
zh_hant: %@ 自動化權限

source: 自动化权限
en: Automation Permission
zh_hant: 自動化權限

source: 完全磁盘访问权限
en: Full Disk Access
zh_hant: 完整磁碟取用權限

source: 尚未确认
en: Not confirmed yet
zh_hant: 尚未確認

source: 未获授权
en: Not granted
zh_hant: 未獲授權

source: %@ 的歌词缓存和播放队列位于受系统保护的目录中。授权后，可直接使用本机已有的歌词，并提前解析即将播放的歌曲；未授权时仍可联网查找歌词。
en: The lyrics caches and play queues of %@ live in system-protected folders. With access, lyrics already on this Mac can be used directly and upcoming tracks can be resolved ahead of time; without it, lyrics are still found online.
zh_hant: %@ 的歌詞快取和播放佇列位於受系統保護的目錄中。授權後，可直接使用本機已有的歌詞，並提前解析即將播放的歌曲；未授權時仍可連線尋找歌詞。

source: 以下播放器尚未安装，可提前选择，安装后自动生效
en: These players aren't installed yet. Select one now and it takes effect once installed.
zh_hant: 以下播放器尚未安裝，可預先選擇，安裝後自動生效

source: 更多播放器（%d）
en: More players (%d)

source: 这台 Mac 上未安装的播放器
en: Players not installed on this Mac
zh_hant: 這台 Mac 上未安裝的播放器

source: 这台 Mac 上未安装此播放器
en: This player isn't installed on this Mac
zh_hant: 這台 Mac 上未安裝此播放器

source: 系统媒体信息通道在本机不可用，可能无法读取播放状态。仅有一种配置可绕过该通道：关闭「自动识别」并只勾选 Apple Music；其他配置均需通过该通道读取。
en: The system media info channel does not work on this Mac, so playback state may not be readable. Only one setup bypasses it: “Auto-detect” off with just Apple Music ticked. Every other setup reads through this channel.
zh_hant: 系統媒體資訊通道在本機不可用，可能無法讀取播放狀態。僅有一種設定可繞過該通道：關閉「自動識別」並只勾選 Apple Music；其他設定均需透過該通道讀取。

source: 选择播放器
en: Choose Players
zh_hant: 選擇播放器

source: Lyrimuse 将显示正在播放的 App 的歌词，之后可随时在设置中更改
en: Lyrimuse shows lyrics for whichever app is playing. You can change this in Settings any time
zh_hant: Lyrimuse 將顯示正在播放的 App 的歌詞，之後可隨時在設定中更改

source: 连续收听 %d 次，点按展开每一次
en: Played %d times in a row — click to show each one
zh_hant: 連續聆聽 %d 次，按一下展開每一次

source: 时间轴整体偏移
en: Whole timeline offset
zh_hant: 時間軸整體偏移

source: 至少两个曲长与本地一致、时间轴相互吻合的歌词源显示，这份歌词整体提前或延后 2.5 秒以上，可能是基于前奏长度不同的另一个母带制作，与当前播放会整首错位
en: At least two sources whose reported length matches this track, and whose timings agree with each other, show this lyric running more than 2.5 seconds early or late throughout — it was most likely synced to another master with a different intro length, so it will be off for the whole song here
zh_hant: 至少兩個曲長與本機一致、時間軸相互吻合的歌詞來源顯示，這份歌詞整體提前或延後 2.5 秒以上，可能是基於前奏長度不同的另一個母帶製作，與目前播放會整首錯位

source: 本轮候选明细已不可用
en: This round's candidate details are no longer available
zh_hant: 本輪候選明細已無法取得

source: 在 Brave 菜单栏中依次选择「显示 → 开发者 → 允许 Apple 事件中的 JavaScript」。
en: In Brave’s menu bar: View → Developer → Allow JavaScript from Apple Events.
zh_hant: 在 Brave 的選單列中依序選擇「顯示方式 → 開發人員選項 → 允許 Apple 事件的 JavaScript」。

source: 未在运行，无法获取当前状态
en: Not running, so its status can’t be read
zh_hant: 未在執行，無法取得目前狀態

source: 每月听歌小结
en: Monthly Listening Digest
zh_hant: 每月聽歌小結

source: 年度听歌小结
en: Yearly Listening Digest
zh_hant: 年度聽歌小結

source: 机器人 Token，形如 123456789:AAH…
en: Bot token, e.g. 123456789:AAH…
zh_hant: 機器人 Token，形如 123456789:AAH…

source: Chat ID：个人为一串数字，群组以 -100 开头
en: Chat ID: a number for a person, starting with -100 for a group
zh_hant: Chat ID：個人為一串數字，群組以 -100 開頭

source: 未填写机器人 Token
en: Bot token not set yet
zh_hant: 未填寫機器人 Token

source: 未填写 Chat ID
en: Chat ID not set yet
zh_hant: 未填寫 Chat ID

source: Lyrimuse 已在「系统设置 › 通用 › 登录项」中关闭，如需开机启动，请在该处重新开启
en: Lyrimuse is turned off in System Settings › General › Login Items. Turn it back on there to open at login
zh_hant: Lyrimuse 已在「系統設定 › 一般 › 登入項目」中關閉，如需在登入時啟動，請在該處重新開啟

source: 推送地址
en: Push URL
zh_hant: 推送網址

source: 机器人 Token
en: Bot Token
zh_hant: 機器人 Token

source: 在 Telegram 中向 @BotFather 发送 /newbot 创建机器人，并将获得的 Token 填入「机器人 Token」。然后向机器人发送任意消息，在浏览器中打开 https://api.telegram.org/bot你的Token/getUpdates，chat 下的 id 即为 Chat ID
en: In Telegram, message @BotFather with /newbot to create a bot and paste the token it gives you into “Bot Token”. Then send your bot a message and open https://api.telegram.org/bot<your token>/getUpdates in a browser — the id under chat is your Chat ID
zh_hant: 在 Telegram 中向 @BotFather 傳送 /newbot 建立機器人，並將取得的 Token 填入「機器人 Token」。然後傳送任意訊息給機器人，在瀏覽器中開啟 https://api.telegram.org/bot你的Token/getUpdates，chat 下的 id 即為 Chat ID

source: 显示专辑简介
en: Show Album Notes
zh_hant: 顯示專輯簡介

source: 查看专辑简介
en: View Album Notes
zh_hant: 檢視專輯簡介

source: 新
en: New

source: 比上一期上升 %@ 名
en: Up %@ from the previous period

source: 比上一期下降 %@ 名
en: Down %@ from the previous period

source: 名次与上一期相同
en: Same rank as the previous period
zh_hant: 名次與上一期相同

source: 上一期未上榜
en: Not in the previous chart

source: 对比 %@ – %@
en: Compared with %@ – %@
zh_hant: 對比 %@ – %@

source: 上一期（%@ – %@）无收听记录，不显示排名变化
en: No scrobbles in the previous period (%@ – %@), so no rank changes
zh_hant: 上一期（%@ – %@）無聆聽記錄，不顯示排名變化

source: 显示歌手简介
en: Show Artist Bio
zh_hant: 顯示歌手簡介

source: 查看歌手简介
en: View Artist Bio
zh_hant: 檢視歌手簡介

source: 出生日期
en: Born

source: 成立时间
en: Formed
zh_hant: 成立時間

source: 类型
en: Genre
zh_hant: 類型

source: %@ 的自动化权限未开启…
en: %@ Automation Access Is Off…
zh_hant: %@ 的自動化權限未開啟…

source: 未授权时，播放进度可能不准确，歌词上的播放控制也无法使用
en: Without it, playback progress may drift and the playback controls on the lyrics won’t work
zh_hant: 未授權時，播放進度可能不準確，歌詞上的播放控制也無法使用

source: 随正在播放的歌曲显示歌词，可显示在桌面、灵动岛、菜单栏和歌词窗口中，并支持对照译文与标注读音。接下来几步将完成基本设置，之后可随时在设置中更改
en: Shows lyrics for whatever’s playing — on the desktop, around the notch, in the menu bar or in a lyrics window, with translations and romanization if you like. The next few steps set it up for you; you can change everything later in Settings.
zh_hant: 隨正在播放的歌曲顯示歌詞，可顯示在桌面、動態島、選單列和歌詞視窗中，並支援對照譯文與標註讀音。接下來幾步將完成基本設定，之後可隨時在設定中更改

source: 随正在播放的歌曲显示歌词，可显示在桌面、灵动岛、菜单栏、触控栏和歌词窗口中，并支持对照译文与标注读音。接下来几步将完成基本设置，之后可随时在设置中更改
en: Shows lyrics for whatever’s playing — on the desktop, around the notch, in the menu bar, on the Touch Bar or in a lyrics window, with translations and romanization if you like. The next few steps set it up for you; you can change everything later in Settings.
zh_hant: 隨正在播放的歌曲顯示歌詞，可顯示在桌面、動態島、選單列、觸控列和歌詞視窗中，並支援對照譯文與標註讀音。接下來幾步將完成基本設定，之後可隨時在設定中更改

source: 菜单栏图标：%@
en: Menu bar icon: %@
zh_hant: 選單列圖像：%@

source: 已在播放但未显示歌词？请检查所选的播放器
en: Already playing but no lyrics? Check the player you picked
zh_hant: 已在播放但未顯示歌詞？請檢查所選的播放器

source: 前往歌词管理手动查找
en: Search manually in Lyrics Manager
zh_hant: 前往歌詞管理手動尋找

source: 前往开启
en: Turn On
zh_hant: 前往開啟

source: 建议开启，以获得更多功能：直接使用本机已有的歌词，并提前准备下一首
en: Recommended for more features: use lyrics already on this Mac and get the next song ready ahead of time
zh_hant: 建議開啟，以取得更多功能：直接使用本機已有的歌詞，並提前準備下一首

source: 建议开启，以获得更多功能：播放进度更准确，并可在歌词上直接控制播放
en: Recommended for more features: more accurate progress, and playback controls right on the lyrics
zh_hant: 建議開啟，以取得更多功能：播放進度更準確，並可在歌詞上直接控制播放

source: 正在应用到歌词引擎…
en: Applying to the lyrics engine…
zh_hant: 正在套用到歌詞引擎…

source: 歌词引擎已停用，更改将在下次启用时生效
en: The lyrics engine is turned off. The change takes effect when it is turned on again.
zh_hant: 歌詞引擎已停用，變更將在下次啟用時生效

source: 上次保存：%@
en: Last saved: %@
zh_hant: 上次儲存：%@

source: 歌词引擎
en: Lyrics Engine
zh_hant: 歌詞引擎

source: 歌词引擎未运行，歌词不会更新
en: The lyrics engine isn’t running; lyrics won’t update
zh_hant: 歌詞引擎未執行，歌詞不會更新

source: 启用失败，可能是权限或系统限制导致歌词引擎未能正常启动。导出诊断信息可查看具体原因，也便于反馈问题
en: Couldn't enable it — a permission or system restriction may have kept the lyrics engine from starting. Export Diagnostics shows the specific cause and makes it easier to report
zh_hant: 啟用失敗，可能是權限或系統限制導致歌詞引擎未能正常啟動。匯出診斷資訊可查看具體原因，也便於回報問題

source: 此版本打包时未同步歌词引擎的版本号。功能不受影响，歌词引擎的代码与 App 为同一版本，无需任何操作
en: This build shipped with a stale version number for the lyrics engine. Nothing is broken — the lyrics engine runs the same code as the app, and there's nothing you need to do.
zh_hant: 此版本打包時未同步歌詞引擎的版本號。功能不受影響，歌詞引擎的程式碼與 App 為同一版本，無需任何操作

source: 歌词引擎尚未启用，本次引导未完成，下次启动时将再次显示
en: The lyrics engine isn't enabled yet, so this doesn't count as finishing setup — you'll be asked again next launch
zh_hant: 歌詞引擎尚未啟用，本次引導未完成，下次啟動時將再次顯示

source: 启动失败（%@）。可先「暂时跳过」，之后在设置的「播放器 → 歌词引擎」中重试，该页面会显示更详细的状态。
en: Couldn't start (%@). You can skip this for now and retry later under Settings → Player → Lyrics Engine, which reports a more detailed status.
zh_hant: 啟動失敗（%@）。可先「暫時略過」，之後在設定的「播放器 → 歌詞引擎」中重試，該頁面會顯示更詳細的狀態。

source: 授权不会作用于已在运行的歌词引擎。在系统设置中勾选后，请回到此处点按「重启歌词引擎」。
en: Granting access doesn’t reach a lyrics engine that’s already running. After turning it on in System Settings, come back here and click Restart Lyrics Engine.
zh_hant: 授權不會作用於已在執行的歌詞引擎。在系統設定中勾選後，請回到此處按一下「重新啟動歌詞引擎」。

source: 重启歌词引擎
en: Restart Lyrics Engine
zh_hant: 重新啟動歌詞引擎

source: 正在重启歌词引擎，需要重新读取歌词缓存，通常需要一到两分钟…
en: Restarting the lyrics engine. It has to read the whole lyrics cache again, which usually takes a minute or two…
zh_hant: 正在重新啟動歌詞引擎，需要重新讀取歌詞快取，通常需要一到兩分鐘…

source: 歌词引擎已重启，但仍无法读取此源。请在系统设置的「完全磁盘访问权限」中确认 Lyrimuse 已开启。
en: The lyrics engine has restarted and this source still can't be read. Check that Lyrimuse is switched on under Full Disk Access in System Settings.
zh_hant: 歌詞引擎已重新啟動，但仍無法讀取此來源。請在系統設定的「完整磁碟取用權限」中確認 Lyrimuse 已開啟。

source: 请在系统设置的「完全磁盘访问权限」中开启 Lyrimuse（如列表中没有，请点按「+」添加），然后回到此处点按「重启歌词引擎」。授权不会作用于已在运行的歌词引擎。
en: Turn on Lyrimuse under Full Disk Access in System Settings (if it isn’t listed, click “+” to add it), then come back and click Restart Lyrics Engine. Access doesn’t reach a lyrics engine that’s already running.
zh_hant: 請在系統設定的「完整磁碟取用權限」中開啟 Lyrimuse（如列表中沒有，請按一下「+」新增），然後回到此處按一下「重新啟動歌詞引擎」。授權不會作用於已在執行的歌詞引擎。

source: 正在重启歌词引擎并重新检查授权…
en: Restarting the lyrics engine and waiting for it to check access again…
zh_hant: 正在重新啟動歌詞引擎並重新檢查授權…

source: 歌词引擎已重启，但仍无法读取。请在系统设置的「完全磁盘访问权限」中确认 Lyrimuse 已开启。
en: The lyrics engine has restarted and still can’t read them. Check that Lyrimuse is switched on under Full Disk Access in System Settings.
zh_hant: 歌詞引擎已重新啟動，但仍無法讀取。請在系統設定的「完整磁碟取用權限」中確認 Lyrimuse 已開啟。

source: 歌词引擎无响应
en: The lyrics engine didn't respond
zh_hant: 歌詞引擎無回應

source: 默认为日文、韩文和粤语标注读音，普通话拼音可在设置中开启
en: Japanese, Korean and Cantonese are annotated by default; turn on Mandarin pinyin in Settings
zh_hant: 預設為日文、韓文和粵語標註讀音，國語拼音可在設定中開啟

source: 启用歌词引擎与权限
en: Engine & Permissions
zh_hant: 啟用歌詞引擎與權限

source: 选择歌词显示方式
en: Choose Where Lyrics Appear
zh_hant: 選擇歌詞顯示方式

source: 歌词引擎为必需组件；权限建议开启，不开启也可使用
en: The lyrics engine is required; the permissions are recommended but optional
zh_hant: 歌詞引擎為必要元件；權限建議開啟，不開啟也可使用

source: 识别歌曲、查找歌词和封面；仅在本机运行，查找歌词时只发送歌名、歌手等曲目信息
en: Recognizes songs and finds lyrics and artwork. Runs only on this Mac; looking up lyrics sends nothing but track info such as title and artist
zh_hant: 識別歌曲、尋找歌詞和封面；僅在本機執行，尋找歌詞時只傳送歌名、歌手等曲目資訊

source: 正在启用…
en: Starting…
zh_hant: 正在啟用…

source: 自动化权限可让播放进度更准确，并可在歌词上直接控制播放
en: Automation access keeps playback progress accurate and lets you control playback right from the lyrics
zh_hant: 自動化權限可讓播放進度更準確，並可在歌詞上直接控制播放

source: 完全磁盘访问权限可让%@直接使用本机已有的歌词，仅读取其歌词缓存和播放队列
en: Full Disk Access lets %@ use lyrics already on this Mac — it only reads their own lyrics cache and play queue
zh_hant: 完整磁碟取用權限可讓%@直接使用本機已有的歌詞，僅讀取其歌詞快取和播放佇列

source: 前往连接
en: Connect
zh_hant: 前往連線

source: 还差最后几步：请完成下方标为橙色的项目
en: Almost there: complete the items marked in orange below
zh_hant: 還差最後幾步：請完成下方標為橘色的項目

source: 点按「开始使用」，让歌词随旋律逐句亮起
en: Click “Get Started” and let every line light up with the music
zh_hant: 按一下「開始使用」，讓歌詞隨旋律逐句亮起

source: 请播放一首歌曲
en: Play a song to try it
zh_hant: 請播放一首歌曲

source: 正在播放广告
en: An ad is playing
zh_hant: 正在播放廣告

source: 歌词已同步显示
en: Lyrics are showing
zh_hant: 歌詞已同步顯示

source: 这首歌曲为纯音乐
en: This one is instrumental
zh_hant: 這首歌曲為純音樂

source: 正在查找歌词…
en: Finding lyrics…
zh_hant: 正在尋找歌詞…

source: 未找到这首歌曲的歌词
en: No lyrics found for this song
zh_hant: 未找到這首歌曲的歌詞

source: 网络无法连接，暂时无法获取歌词
en: Can’t reach the network — no lyrics yet
zh_hant: 網路無法連線，暫時無法取得歌詞

source: 歌曲开始播放后将显示歌词
en: Lyrics will show once the song starts
zh_hant: 歌曲開始播放後將顯示歌詞

source: 正在播放「%@」
en: Now playing “%@”

source: 已选择的播放器
en: Selected players
zh_hant: 已選擇的播放器

source: 位于菜单栏
en: In the menu bar
zh_hant: 位於選單列

source: 点按图标可打开设置和歌词窗口
en: Click the icon to open Settings and the lyrics window
zh_hant: 按一下圖像可開啟設定和歌詞視窗

source: 同步你的收听记录
en: Sync your listening history
zh_hant: 同步你的聆聽記錄

source: 自动识别正在播放的 App
en: Whichever app is playing, detected automatically
zh_hant: 自動識別正在播放的 App

source: 自动识别正在播放的 App，以及 %@
en: Whichever app is playing, plus %@
zh_hant: 自動識別正在播放的 App，以及 %@

source: %@（未安装）
en: %@ (not installed)
zh_hant: %@（未安裝）

source: 导入失败：无法读取所选文件，可能尚未下载到本机或无读取权限
en: Import failed: couldn't read the selected file. It may not be downloaded to this Mac, or Lyrimuse can't read it.
zh_hant: 匯入失敗：無法讀取所選檔案，可能尚未下載到本機或無讀取權限

source: 自动跳过 YouTube Music 广告
en: Skip YouTube Music Ads Automatically
zh_hant: 自動略過 YouTube Music 廣告

source: 出现「跳过」按钮时自动点按，无法跳过的广告照常播放。需要「辅助功能」权限。YouTube Music 位于后台标签页时会短暂切换过去再切回，当前使用的浏览器窗口不受影响。
en: Presses Skip as soon as it appears; ads that can't be skipped still play. Needs Accessibility permission. If YouTube Music is in a background tab, Lyrimuse briefly switches to it and back without touching the browser window you're using.
zh_hant: 出現「略過」按鈕時自動按一下，無法略過的廣告照常播放。需要「輔助使用」權限。YouTube Music 位於背景分頁時會短暫切換過去再切回，目前使用的瀏覽器視窗不受影響。

source: 已自动跳过广告
en: Ad skipped automatically
zh_hant: 已自動略過廣告

source: 尚未获得「辅助功能」权限，自动跳过不会生效。如已授权但仍显示此提示，请在系统设置中将 Lyrimuse 取消勾选后重新勾选。
en: Accessibility permission isn't granted yet, so automatic skipping won't work. If you granted it before and still see this, turn Lyrimuse off and back on in System Settings.
zh_hant: 尚未取得「輔助使用」權限，自動略過不會生效。如已授權但仍顯示此提示，請在系統設定中將 Lyrimuse 取消勾選後重新勾選。

source: Apple Music 登录已失效（已过期或被撤销），请重新连接
en: Your Apple Music sign-in is no longer valid (expired or revoked). Reconnect to continue.
zh_hant: Apple Music 登入已失效（已過期或被撤銷），請重新連線

source: MV
en: Music Video

source: 调整宽度
en: Adjust Width
zh_hant: 調整寬度

source: 完成调整宽度
en: Done Adjusting Width
zh_hant: 完成調整寬度

source: 关闭悬浮歌词
en: Close Floating Lyrics
zh_hant: 關閉浮動歌詞

source: 解锁位置
en: Unlock Position
zh_hant: 解鎖位置

source: 间奏中多出一段歌词
en: Extra lyrics in an instrumental break
zh_hant: 間奏中多出一段歌詞

source: 至少两个曲长与本地一致的歌词源显示这一段是间奏、没有歌词，而这份歌词在此处放入了其他段落的歌词，时间轴有误，播放到中段时会错位
en: At least two sources whose reported length matches this track have no lyrics here — it is an instrumental break — yet this one places lines copied from elsewhere in the song inside it. Its timing is wrong, so the middle of the song will be out of step here
zh_hant: 至少兩個曲長與本機一致的歌詞來源顯示這一段是間奏、沒有歌詞，而這份歌詞在此處放入了其他段落的歌詞，時間軸有誤，播放到中段時會錯位

source: 全屏时隐藏
en: Hide in Full Screen
zh_hant: 全螢幕時隱藏

source: 灵动岛所在屏幕有 App 全屏时隐藏
en: Hides while an app is full screen on its display
zh_hant: 動態島所在螢幕有 App 全螢幕時隱藏

source: 复用其他专辑中的同一首歌曲
en: Reused from the same recording on another album
zh_hant: 沿用其他專輯中的同一首歌曲

source: 复用同一首歌曲的其他歌手写法
en: Reused from the same song under another artist spelling
zh_hant: 沿用同一首歌曲的其他歌手寫法

source: 显示 10 首
en: Show 10 songs
zh_hant: 顯示 10 首

source: 正在读取其余歌曲…
en: Loading the rest…
zh_hant: 正在讀取其餘歌曲…

source: 此期间的歌曲排行中无该歌手的歌曲
en: No songs by this artist in this period's track chart
zh_hant: 此期間的歌曲排行中無該歌手的歌曲

source: 在 KKBOX 中显示
en: Show in KKBOX
zh_hant: 在 KKBOX 中顯示

source: 生成 .zip 文件，其中包含最近播放的曲目名称与本机文件路径，公开发布前建议先解压检查
en: Creates a .zip file. It keeps recently played track names and local file paths, so review it before posting publicly
zh_hant: 產生 .zip 檔案，其中包含最近播放的曲目名稱與本機檔案路徑，公開發佈前建議先解壓縮檢查

source: 运行日志
en: Activity Log
zh_hant: 執行記錄檔

source: %@ · 供自行排查；反馈问题请使用上方的「导出诊断」，信息更完整
en: %@ · For your own troubleshooting. To report a problem, use Export Diagnostics above; it includes more
zh_hant: %@ · 供自行排查；回報問題請使用上方的「匯出診斷」，資訊更完整
